---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetGlossiness(System.Double)
source: html/15378b4c-bcf8-74a8-5f55-ebf13c1d1496.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetGlossiness Method

Sets the glossiness parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetGlossiness(
	double glossiness
)
```

## Parameters
- **glossiness** (`System.Double`) - The glossiness value.